
export const mainInfo = {
type: "main",
pictures : [<div className = "row">
        <div className="col-12 col-sm-12 col-md-4 mt-1">
        <img src="../pictures/mainDisplay/1.jpeg" className="img-fluid" alt="Responsive image"/>
        </div>
        <div className="col-12 col-sm-12 col-md-4 mt-1">
        <img src="./pictures/mainDisplay/2.jpeg" className="img-fluid" alt="Responsive image"/>
        </div>
        <div className="col-12 col-sm-12 col-md-4 mt-1">
        <img src="./pictures/mainDisplay/3.jpeg" className="img-fluid" alt="Responsive image"/>
        </div>
    </div>],

info: {
    arrInfo:[<div className="col-12 col-sm-12 col-md-6 mt-1">
    <h3 className="alert alert-dismissible alert-info">Персональный тренер? <br />Зачем?  Я и сам смогу!</h3>
    <p>Конечно сможете ! Ведь зайти в тот же Google и посмотреть какую-то программу , а дальше на YouTube технику выполнения упражнений ,не так уж и сложно ! Правда ?
    <span className="card  text-white bg-dark mt-1 mb-1">
    Тогда зачем мне тренер ?
    <br />Все очень просто , ответ — это время . Тренер поможет сократить  ту самую череду проб и ошибок и ускорить ваш результат в разы .
    </span></p>
    <p>
    Возьмём к примеру новичка который будет первых 4—6 месяца только входить в режим , спотыкаясь на собственных ошибках касательно сбалансированного рациона , правильного режима , техники выполнения упражнения , техники дыхания во время упражнения и тд .
    <br />
    И только через это время он начнёт постепенно давать результат и в итоге за год прийдет к определенным достижениям. 
    <br />
    Или тот же условный новичок , начнёт заниматься с персональным тренером , который этот весь путь ему сократит и уже за первую же неделю он узнаёт столько нюансов , сколько он бы узнавал первые месяцы.
    <br />
    <span className="card text-white bg-dark mt-1 mb-1">И вероятнее всего с квалифицированным тренером он придёт к результату не за год , а за ≈ 3—5 мес , так как ему не приходится в одиночку все узнавать и пробовать . 
    В итоге мы имеем переплату в виде персонального  тренера — это факт , но более быстрый и здоровый результат . А самое важное —экономию вашего времени , а время , как мы знаем  — скоротечно !</span>
    </p>
    </div>,
    <div className="col-12 col-sm-12 col-md-6 mt-1">
    <h3 className="alert alert-dismissible alert-info">Как  мне получить желаемый результат ?</h3>
    Все очень просто ! <br />Допустим вы пришли к персональному тренеру и ждёте что теперь все будет просто и результат появится даже при 1 тренировке в неделю и легко без труда все случится само собой и станете здоровыми и красивыми !
    <br />Заранее огорчу — скорее всего нет . 
    <br />Тренер вам укажет всегда верное направление и поможет в трудных ситуациях ! 
    <p>Но давайте представим , что есть <mark>стакан</mark> и он пуст и чтоб вы получили свой результат он должен быть полным каждый день.
    </p>
    <ul className="card  text-white bg-dark mt-1 mb-1"><span className="h5 text-white">Как его заполнить?</span>
    Тут и будет самая простая и понятная для многих часть !
    <br />
    <li>1 тренировка — это ваша капля в стакан </li>
    <li>Здоровый сон — это тоже капля в тот же стакан </li>
    <li>Питьевой режим — та же  история </li>
    <li>Сбалансированное питание с учетом БЖУ — ещё капля </li>
    <li>Бросить курить — ещё </li>
    <li>Бросить пить — ещё </li>
    <li>Вместо жаренной еды , сварить — ещё капля </li>
    <li>Помогать организму БАДАми — ещё </li>
    <li>Правильно подобранная тренировка — ещё </li>
    <li>Поставленное дыхание — ещё </li>
    <li>Вместо телевизора перед сном , прогулка 30+ минут — еще</li>
    <li>Вместо рафинированного сахара — фрукты ! Ещё капля </li>
    <li>Не забывать о необходимых жирах — туда же </li>
    <li>Всегда добавлять в рацион овощи — ещё</li>
    <li>Разобраться хотя бы поверхностно , что такое ЦНС и как не перегружать ее на тренировках — ещё капля </li>
    </ul>
    <p>
    И таких пунктов будет очень много , до полного стакана ! 
    И вот мы имеем , не сложную для чтения , но сложную для понимания многих , что все это работает только вместе в совокупности и если что либо выпадает , выпадает и ваш результат !</p>
    </div>
],    
}
}

export const aboutMe = {
    type:'about',
    pictures:[
        <div className="col-12 col-sm-12 col-md-6">
        <img src="../pictures/aboutme/1.jpeg" className="img-fluid" alt="Responsive image"></img>
        </div>
   ],
    info:[
        
            <div className="col-12 col-sm-12 col-md-6">
            <h5 className="alert alert-dismissible alert-info m-1">Правильные тренера и хороший подход заложил любовь к спорту с самого детства!</h5> 
            <p>Занятия самбо и гандболом в школьные года , заложили базу и понимание того , какой должен быть спорт и здоровый образ жизни . 
            Университетские года, показали, на сколько может быть полезен во многих смыслах тренажёрный зал.
            <br />
            Само слово спорт, на мое мнение, в головах людей имеет абсолютно разный смысл!
            </p> 
            <p>
            <br />Кто-то  понимает это, как тяжелые приседания в зале, бесконечные тренировки и жить ради спорта, а не наоборот. 
            <br />А кто-то видит его, как просто скручивания на пресс миллион раз и этого хватит. 
            <br />У каждого «свой спорт»  и каждый занимается им так, как он себе его представляет. 
            <br /> <mark className="card text-white bg-dark mt-1 mb-1"> Я считаю, спорт — это те физические нагрузки , которые позволяют тебе постепенно прийти к результату , при этом улучшить параллельно здоровье , как физическое так и ментальное и выйти из зала (если это зал) , с чувством легкой усталости и при этом сил хватит ещё на целый день активности и радости жизни !</mark> 
            <br />Считаю что если ваша цель — это здоровье, то спорт должен быть умеренным , относительно легким и приятным ! Если вы идёте на тренировку и чувствуете что надо , а не вы  этого хотите , значит вы или ваш тренер делает что-то не так . Вам должно нравится то что вы делаете и результат который получаете ! 

            <br />С опытом работы более 8 лет , считаю что мотиватором для себя должны быть вы сами, а не кто-то другой, считаю что если вы начали заниматься собой — это уже говорит о том что вам не безразлично ваше тело и ваше здоровье ! Тем более , от состояния вашего тела , полностью зависит и качество вашей же жизни! 

            </p>
            <ul className="alert-dismissible alert-success text-dark">
        <span className=" mb-1">Скромный опыт, который я успел получить:</span>
        <li>Feel good — мой первый зал с которого и начал работать в фитнес сфере , Украина , Днепр .</li>
    
        <li>QSL GYM — страна Китай, город Chengdu, тут я получил отличный опыт и квалифицированные курсы по тренировочному процессу и работе с клиентами , а так же курсы нутрициолога по составлению плана питания для клиентов и курсы групповых тренировок Body pump.</li>
    
        <li>ReGym — многим знакомый зал. Украина, город Днепр</li>
        </ul>
        <p>
        <mark className="card text-white bg-dark mt-1 mb-1"> Опыт — это то, чему все обычно доверяют, но я считаю что можно быть с опытом в 1 год и развиваться быстрее и знать больше чем тот же человек опытом в 10-15 и более лет, который не хочет изначально развиваться и учиться новому. Ничего не стоит на месте и постоянно появляются новые исследования и новая информация и нужно всегда быть в курсе событий! </mark>
        </p>
    
            </div>
       
    ]
}

export const resultCreator = ({name , result , photo , information , id})=>{
    return (
        <div className="card col-12 col-sm-12 col-md-5 m-1">
        <img src={photo} alt="" className="card-img-top img-fluid"/>
        <div className="card-body">
            <p className="card-text">{name}</p>
            <p>{result}</p>
            <a className="btn btn-primary" data-bs-toggle="collapse" href={`#${id}`} role="button" aria-expanded="false" aria-controls="collapseExample">
             Подробнее
            </a>
            <div className="collapse" id={id}>
                <div className="card card-body mt-2">
                    {information}
                </div>
            </div>

        </div>
        </div>
    )
}

export const result = {
type:'result',
client1:{
    name:['Ярослав'],
    result: ['-25'],
    photo:['./results/yar/yar.jpg'],
    information:[<>
        <p>На фото справа видно , как выглядит лицо человека который за 4 месяца добился результата в ➖2️⃣0️⃣кг ✅ и при этом остался здоровым и жизнерадостным 😁</p> <p> При этом за весь период похудения ни разу не пожаловался на то что хочет «кушать» и от голода не может уснуть и тд . Только говорил о том что «устал кушать постоянно и в таких объемах» 😂 Работы еще нам предстоит много , это только малая часть пути . Но даже эти 4 месяца это не малый труд , огромная сила воли и желание изменить себя в лучшую и здоровую сторону 👍😉</p></>],
    id:['yar'],
},
client2: {
    name: ["Наталья"],
    result: ["-10 кг"],
    photo: ['./results/nh/nh.jpg'],
    information: ["все замечательно видно 3 тренировки в неделю , стабильно и без пропусков ! Все еще работаем, но уже картинка вырисовывается приятная 👍 Наташа , яркий пример того , что можно трудиться и веселиться в зале и при этом получать желаемый результат 😁"],
    id: ['nh'],
},
client3:{
    name:["Ольга"],
    result:["-10 кг"],
    photo:["./results/ol/ol.jpg"],
    information:[<><p>💭Сверх позитивная спортсменка 🔥
    🌸Если говорить об отличном настроении 🔆круглый год и запасе энергии ⚡️- это про Олю 😇
    </p>
    <ul>
    🔥К чему пришли :
    <li>✅ Сбросили часть лишней жировой ткани</li>
    <li>✅ Нарастили мышц</li>
    <li>✅ Увеличили силовые показатели</li>
    <li>✅ Сбалансировали и наладили питание ⚠️🥦</li>
    <li>✅ Улучшили здоровье ❤️</li>
    <li>✅ Сбалансировали пропорции тела 🌸</li>
    <li>✅🔥 Хорошая осанка 🔥</li>
    <li>✅Выровняли женские циклы 🩸</li>
    <li>✅ Исправили болевые ощущения при ходьбе в правой ноге 🦵</li>
    </ul>
    <ul>⚠️ Как ?
           <li>🔥 3 тренировки в неделю 💪</li>
           <li>🔥 План питания 🥦</li>
           <li>🔥 Учет состояния здоровья и ЦНС ❤️</li>
           <li>🔥Минимум пропусков 🙏</li>
           <li>🔥 Доверие своему тренеру 😇</li>
           <li>🔥 Полная самоотдача и желание</li>
           <li>🔥Точно знает чего хочет от спорта и тренировок 👏</li>
       </ul>
   <p>
    Нам есть еще над чем работать 🔥, но мы явно на правильном пути ✅</p> </>],
    id:["ol"],
    
},
client4:{
    name:['Виктория'],
    result:['+9 кг'],
    photo:['./results/ov/ov.jpg'],
    information:[<>
    <p>Так , выглядит 8️⃣ месяцев совместной работы с одной из моих спортсменок 🌸</p>
    <ul>🎯 Цели :
        <li>🔥 Набрать мышечной массы</li>
        <li>🔥 Улучшить здоровье</li>
        <li>🔥Наладить питание</li>
        <li>🔥Изменить пропорции тела</li>
        <li>🔥Улучшить осанку и тд</li>
    </ul>
    <ul>😲 Чего достигли:
        <li>✅ +8 кг массы тела</li>
        <li>✅Сбалансировали питание</li>
        <li>✅Подобрали правильное сочетание Белков, Жиров, Углеводов</li>
        <li>✅Разгрузили ЦНС</li>
        <li>✅Ощутимо улучшили осанку 🔥</li>
        <li>✅ Улучшилось качество кожи и волос</li>
        <li>✅ Значительно выросли силовые показатели , что говорит о росте мышечной массы</li>
        <li>✅ Сузили талию 🔥 (За счет увеличения ягодичных мышц и пропорций спины и дельтовидных мышц)</li>
        <li>✅ Скорость восстановления сердечно-сосудистой системы ❤️ значительно выросла 🔥</li>
    </ul>
    <ul>📚Как мы это сделали :
        <li>💪 С самого старта - 3️⃣ тренировки в неделю</li>
        <li>💪 Запись питания и отчет каждую тренировку</li>
        <li>💪 Слушает и слышит своего тренера 😍</li>
        <li>💪 Доверие 😇`</li>
    </ul>
    </>],
    id:['ov'],
    
},
client5:{
    name:["Наталья"],
    result:["-24 кг"],
    photo:['./results/nat/nat.jpg'],
    information:[
        <>
        <ul>Что мы тут имеем ? И так :
            <li>1. Артроз тазобедренного сустава</li>
            <li>2. Варикозное расширение вен на ногах</li>
            <li>3 Проблемы с коленными суставами</li>
            <li>И это далеко не полный список !</li>
        </ul>
        <p>
        Все эти противопоказания накладывают значительные ограничения при работе с тренажерами и любыми свободными весами. Чего достигли ?</p>
        <p>Снижение массы тела с 95 кг до 71 кг ➡️(-24 кг) ⬅️при росте в 175 см , частичное восстановление подвижности тазобедренного сустава , значительное снижение болей в коленях , ощутимое улучшение общего самочувствия . И все это за 6️⃣ месяцев совместных усилий! 🔴</p>
        <p>Из за проблем со здоровьем даже ходьба на беговой дорожке в медленном темпе была противопоказана.
        НО . Правильно подобранный рацион и регулярные совместные тренировки дали свой результат!
        Основная работа персонального тренера - это указать верный путь , но главную и самую тяжелую работу делает сам подопечный!</p>
        </>
    ],
    id:['nat'],
    
},
client6:{
    name:["Игорь"],
    result:["-11 кг"],
    photo:['./results/ig/ig.jpg'],
    information:[
        <>
        <ul>💪Отличный спортсмен с отличными результатами , за 3,5 мес совместной работы!
            <li>✅ -11 кг общего веса</li>
            <li>✅ Набрали мышц , увеличили силовые показатели</li>
            <li>✅ Восстановили колено</li>
            <li>✅ Улучшили общий внешний вид и качество тела в целом</li>
            <li>✅ Никакой пищевой зависимости , только сбалансированный рацион</li>
            <li>✅ Конечно же сбросили не мало жировой прослойки</li>
            <li>✅ Улучшили работу ЖКТ</li>
        </ul>
        <ol> Нам предстоит еще много работы , но даже за такой период - смог существенно улучшить здоровье и тело ! 💪💪💪
        Ничего сложного в этом нет :
          <li>питание</li>
          <li>3 тренировки в неделю</li>
          <li>хороший сон</li>
          <li>учет ограничений организма и общего его состояния</li>
          <li>правильный подбор тренировок и рациона</li>
        </ol>
        </>
    ],
    id:['ig'],
    
},
client7:{
    name:['Евгения'],
    result:['+6 кг'],
    photo:['.//results/ev/ev.jpg'],
    information:[<>
    <ul>Веселые и продуктивные тренировки - это про Женю 🔥
        <li>4️⃣ Месяца тренировок 📍</li>
        <li>✅ Набрали мышечной массы</li>
        <li>✅ Улучили состояние плеча</li>
        <li>✅ Наладили осанку</li>
        <li>✅ Сбалансировали рацион питания</li>
        <li>✅ Улучшили состояние ЦНС и тд</li>
        <li>📍Нам есть еще над чем работать,но мы явно на правильном пути 💪🔥</li>
    </ul>
    </>],
    id:['ev'],
    
},
client8: {
    name: ["小天"],
    result: ["-13 кг"],
    photo: ["./results/ch/ch.jpg"],
    information: [
        <>
        <p>Трудяга из Китая , дает результат -13 кг на сегодняшний день ! 👍
    Работаем удаленно</p></>
    ],
    id: "ch",
}

}


export const videoBlockCreator = ({folder , numberOfvideo}) =>{
const counter = numberOfvideo;
const arr = [];
for(let i = 0 ; i < counter ; i++){
arr.push(<div className="embed-responsive embed-responsive-21by9 col-12 col-sm-12 col-md-6 mt-2">
<video controls={true} poster="" className="embed-responsive-item">
            <source src={`${folder}${i+1}.mp4`} type="video/mp4"/>
          </video>
</div>)
}
return arr;
}

export const video = {
    type:'video',
    folder:['./video/'],
    numberOfvideo: 12,
}

export const picturesBlockCreator = ({folder , numberOfpictures}) =>{

const counter = numberOfpictures;
const arr = [];

for(let i = 0 ; i < counter ; i++){
    arr.push(
        <div className="col-12 col-sm-12 col-md-4 mb-1">
            <img src={`${folder}${i+1}.jpg`} alt="" className="rounded img-fluid"/></div>
    )
}
return arr;
}

export const gymPictures = {
    type:'gym',
    folder:['./pictures/gym/'],
    numberOfpictures: 6,
}

export const priceBlockCreator = ({folder,mainInfo,mainInfo2}) =>{
return (
    <div className="col-12 card text-center mb-3 p-1">
        <img className="card-img-top" src={`${folder}1.jpg`} alt="Card image cap"/>
<div className="card-body">
  <h5 className="card-title">{mainInfo}</h5>
  <p className="card-text">{mainInfo2}</p>
  <p className="card-text"><small className="text-muted">{}</small></p>
</div>
    </div>
)
}
export const price = {
    type:'price',
    mainInfo:['Тренер 2 категории'],
    mainInfo2:['Набор : уточняйте'],
    folder:['./pictures/price/'],
    numberOfpictures:1,
}